In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
data = Series(np.random.randn(10), index=[list("aaabbbccdd"), [1,2,3,1,2,3,1,2,2,3]])
data

a  1   -0.594925
   2    1.129774
   3    2.695409
b  1    0.523680
   2   -1.359623
   3    0.438750
c  1   -0.078980
   2   -1.755801
d  2    0.355517
   3    1.943656
dtype: float64

The "index" here is really a `MultiIndex`

In [3]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [4]:
data["b"]

1    0.523680
2   -1.359623
3    0.438750
dtype: float64

In [5]:
data["b":"c"]

b  1    0.523680
   2   -1.359623
   3    0.438750
c  1   -0.078980
   2   -1.755801
dtype: float64

In [7]:
data[:, 2]

a    1.129774
b   -1.359623
c   -1.755801
d    0.355517
dtype: float64

In [8]:
data.unstack()

          1         2         3
a -0.594925  1.129774  2.695409
b  0.523680 -1.359623  0.438750
c -0.078980 -1.755801       NaN
d       NaN  0.355517  1.943656

In [9]:
data.unstack().stack()

a  1   -0.594925
   2    1.129774
   3    2.695409
b  1    0.523680
   2   -1.359623
   3    0.438750
c  1   -0.078980
   2   -1.755801
d  2    0.355517
   3    1.943656
dtype: float64

In [11]:
frame = DataFrame(np.random.random((4,3)), index=[list("aabb"), [1,2,1,2]],
                 columns=[["Leeds", "Leeds", "York"], ["one","two","one"]])
frame

        Leeds                York
          one       two       one
a 1  0.640782  0.773419  0.988197
  2  0.441193  0.195902  0.560815
b 1  0.289754  0.602908  0.374370
  2  0.905032  0.105420  0.597832

In [13]:
frame.index.names = ["letter", "number"]
frame.columns.names = ["City", "label"]
frame

City              Leeds                York
label               one       two       one
letter number
a      1       0.640782  0.773419  0.988197
       2       0.441193  0.195902  0.560815
b      1       0.289754  0.602908  0.374370
       2       0.905032  0.105420  0.597832

In [14]:
frame["Leeds"]

label               one       two
letter number
a      1       0.640782  0.773419
       2       0.441193  0.195902
b      1       0.289754  0.602908
       2       0.905032  0.105420

In [19]:
frame.ix["a"]["Leeds"]

label        one       two
number
1       0.640782  0.773419
2       0.441193  0.195902

## Reording and sorting levels ##

In [20]:
frame.swaplevel("letter", "number")

City              Leeds                York
label               one       two       one
number letter
1      a       0.640782  0.773419  0.988197
2      a       0.441193  0.195902  0.560815
1      b       0.289754  0.602908  0.374370
2      b       0.905032  0.105420  0.597832

In [21]:
frame.swaplevel(0,1).sortlevel(0)

City              Leeds                York
label               one       two       one
number letter
1      a       0.640782  0.773419  0.988197
       b       0.289754  0.602908  0.374370
2      a       0.441193  0.195902  0.560815
       b       0.905032  0.105420  0.597832

In [23]:
frame.sum(level="letter")

City       Leeds                York
label        one       two       one
letter
a       1.081975  0.969321  1.549012
b       1.194785  0.708328  0.972202

In [25]:
frame.sum(level="label", axis=1)

label               one       two
letter number
a      1       1.628979  0.773419
       2       1.002008  0.195902
b      1       0.664123  0.602908
       2       1.502864  0.105420

## Moving between indexes and columns ##

In [27]:
frame = DataFrame({"a":range(7), "b":range(7,0,-1),
                  "c":["one","one","one","two","two","two","two"],
                   "d":[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [30]:
frame2 = frame.set_index(["c","d"])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [29]:
frame.set_index(["c","d"], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [31]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1